; domain
(define (domain alfred-domain)
 (:requirements :strips :typing :negative-preconditions :disjunctive-preconditions :conditional-effects :existential-preconditions :constraints :action-costs)
 (:types
    receptacletype objecttype checkable - object
    agent location receptacle obj - checkable
 )
 (:constants
   sinkbasintype microwavetype fridgetype - receptacletype
   butterknifetype knifetype - objecttype
 )
 (:predicates (atlocation ?a - agent ?l - location) (receptacleatlocation ?r - receptacle ?l - location) (objectatlocation ?o - obj ?l - location) (openable ?r - receptacle) (opened ?r - receptacle) (inreceptacle ?o - obj ?r - receptacle) (isreceptacleobject ?o - obj) (inreceptacleobject ?innerobject - obj ?outobject - obj) (isreceptacleobjectfull ?o - obj) (wasinreceptacle ?o - obj ?r - receptacle) (checked ?c - checkable) (examined ?l - location) (receptacletype_0 ?r - receptacle ?rt - receptacletype) (cancontain ?rt - receptacletype ?ot - objecttype) (objecttype_0 ?o - obj ?t - objecttype) (holds ?a - agent ?o - obj) (holdsany ?a - agent) (holdsanyreceptacleobject ?a - agent) (full ?r - receptacle) (isclean ?o - obj) (cleanable ?o - obj) (ishot ?o - obj) (heatable ?o - obj) (iscool ?o - obj) (coolable ?o - obj) (pickupable ?o - obj) (moveable ?o - obj) (toggleable ?o - obj) (ison ?o - obj) (istoggled ?o - obj) (sliceable ?o - obj) (issliced ?o - obj))
 (:functions (total-cost))
 (:action look
  :parameters ( ?a - agent ?l - location)
  :precondition (and (atlocation ?a ?l))
  :effect (and (checked ?l) (increase (total-cost) 1)))
 (:action inventory
  :parameters ( ?a - agent)
  :effect (and (checked ?a) (increase (total-cost) 1)))
 (:action examinereceptacle
  :parameters ( ?a - agent ?r - receptacle)
  :precondition (and (exists (?l_0 - location)
 (and (atlocation ?a ?l_0) (receptacleatlocation ?r ?l_0))))
  :effect (and (checked ?r) (increase (total-cost) 1)))
 (:action examineobject
  :parameters ( ?a - agent ?o - obj)
  :precondition (and (or (exists (?l_0 - location)
 (exists (?r_0 - receptacle)
 (and (atlocation ?a ?l_0) (receptacleatlocation ?r_0 ?l_0) (inreceptacle ?o ?r_0) (or (not (openable ?r_0)) (opened ?r_0))))) (holds ?a ?o)))
  :effect (and (checked ?o) (increase (total-cost) 1)))
 (:action gotolocation
  :parameters ( ?a - agent ?lstart - location ?lend - location)
  :precondition (and (atlocation ?a ?lstart))
  :effect (and (not (atlocation ?a ?lstart)) (atlocation ?a ?lend) (increase (total-cost) 1)))
 (:action openobject
  :parameters ( ?a - agent ?l - location ?r - receptacle)
  :precondition (and (openable ?r) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (not (opened ?r)))
  :effect (and (opened ?r) (checked ?r) (increase (total-cost) 1)))
 (:action closeobject
  :parameters ( ?a - agent ?l - location ?r - receptacle)
  :precondition (and (openable ?r) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (opened ?r))
  :effect (and (not (opened ?r)) (increase (total-cost) 1)))
 (:action pickupobject
  :parameters ( ?a - agent ?l - location ?o - obj ?r - receptacle)
  :precondition (and (pickupable ?o) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (inreceptacle ?o ?r) (not (holdsany ?a)) (or (not (openable ?r)) (opened ?r)))
  :effect (and (not (inreceptacle ?o ?r)) (holds ?a ?o) (holdsany ?a) (not (objectatlocation ?o ?l)) (increase (total-cost) 1)))
 (:action putobject
  :parameters ( ?a - agent ?l - location ?o - obj ?r - receptacle ?ot - objecttype ?rt - receptacletype)
  :precondition (and (holds ?a ?o) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (or (not (openable ?r)) (opened ?r)) (objecttype_0 ?o ?ot) (receptacletype_0 ?r ?rt) (cancontain ?rt ?ot))
  :effect (and (inreceptacle ?o ?r) (objectatlocation ?o ?l) (not (holds ?a ?o)) (not (holdsany ?a)) (increase (total-cost) 1)))
 (:action cleanobject
  :parameters ( ?a - agent ?l - location ?r - receptacle ?o - obj)
  :precondition (and (cleanable ?o) (receptacletype_0 ?r sinkbasintype) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (holds ?a ?o))
  :effect (and (isclean ?o) (increase (total-cost) 1)))
 (:action heatobject
  :parameters ( ?a - agent ?l - location ?r - receptacle ?o - obj)
  :precondition (and (heatable ?o) (receptacletype_0 ?r microwavetype) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (holds ?a ?o))
  :effect (and (ishot ?o) (not (iscool ?o)) (increase (total-cost) 1)))
 (:action coolobject
  :parameters ( ?a - agent ?l - location ?r - receptacle ?o - obj)
  :precondition (and (coolable ?o) (receptacletype_0 ?r fridgetype) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (holds ?a ?o))
  :effect (and (iscool ?o) (not (ishot ?o)) (increase (total-cost) 1)))
 (:action toggleobject
  :parameters ( ?a - agent ?l - location ?o - obj ?r - receptacle)
  :precondition (and (toggleable ?o) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (inreceptacle ?o ?r))
  :effect (and (when (ison ?o) (not (ison ?o))) (when (not (ison ?o)) (ison ?o)) (istoggled ?o) (increase (total-cost) 1)))
 (:action sliceobject
  :parameters ( ?a - agent ?l - location ?co - obj ?ko - obj)
  :precondition (and (sliceable ?co) (or (objecttype_0 ?ko knifetype) (objecttype_0 ?ko butterknifetype)) (atlocation ?a ?l) (objectatlocation ?co ?l) (holds ?a ?ko))
  :effect (and (issliced ?co) (increase (total-cost) 1)))
 (:action help
  :parameters ( ?a - agent)
  :effect (and (checked ?a) (increase (total-cost) 1)))
)

; problem
(define (problem alfred-problem)
 (:domain alfred-domain)
 (:objects
   sidetabletype armchairtype stoveburnertype garbagecantype cabinettype coffeemachinetype carttype sofatype - receptacletype
   winebottletype spraybottletype mugtype tissueboxtype newspapertype soapbartype saltshakertype pantype - objecttype
   agent1 - agent
   location1 location2 location3 location4 location5 location6 location7 location8 - location
   sidetable_1 armchair_2 stoveburner_3 garbagecan_4 cabinet_5 coffeemachine_6 cart_7 sofa_8 microwave_9 fridge_10 - receptacle
   winebottle_1 spraybottle_2 mug_3 tissuebox_4 newspaper_5 soapbar_6 saltshaker_7 pan_8 - obj
 )
 (:init (receptacletype_0 sidetable_1 sidetabletype) (receptacletype_0 armchair_2 armchairtype) (receptacletype_0 stoveburner_3 stoveburnertype) (receptacletype_0 garbagecan_4 garbagecantype) (receptacletype_0 cabinet_5 cabinettype) (receptacletype_0 coffeemachine_6 coffeemachinetype) (receptacletype_0 cart_7 carttype) (receptacletype_0 sofa_8 sofatype) (receptacletype_0 microwave_9 microwavetype) (receptacletype_0 fridge_10 fridgetype) (objecttype_0 winebottle_1 winebottletype) (objecttype_0 spraybottle_2 spraybottletype) (objecttype_0 mug_3 mugtype) (objecttype_0 tissuebox_4 tissueboxtype) (objecttype_0 newspaper_5 newspapertype) (objecttype_0 soapbar_6 soapbartype) (objecttype_0 saltshaker_7 saltshakertype) (objecttype_0 pan_8 pantype) (cancontain sidetabletype winebottletype) (cancontain sidetabletype spraybottletype) (cancontain sidetabletype mugtype) (cancontain sidetabletype tissueboxtype) (cancontain sidetabletype newspapertype) (cancontain sidetabletype soapbartype) (cancontain sidetabletype saltshakertype) (cancontain sidetabletype pantype) (cancontain armchairtype newspapertype) (cancontain stoveburnertype pantype) (cancontain garbagecantype winebottletype) (cancontain garbagecantype spraybottletype) (cancontain garbagecantype tissueboxtype) (cancontain garbagecantype newspapertype) (cancontain garbagecantype soapbartype) (cancontain cabinettype winebottletype) (cancontain cabinettype spraybottletype) (cancontain cabinettype mugtype) (cancontain cabinettype tissueboxtype) (cancontain cabinettype newspapertype) (cancontain cabinettype soapbartype) (cancontain cabinettype saltshakertype) (cancontain cabinettype pantype) (cancontain coffeemachinetype mugtype) (cancontain carttype spraybottletype) (cancontain carttype mugtype) (cancontain carttype tissueboxtype) (cancontain carttype soapbartype) (cancontain sofatype newspapertype) (cancontain microwavetype mugtype) (cancontain fridgetype winebottletype) (cancontain fridgetype mugtype) (cancontain fridgetype pantype) (pickupable winebottle_1) (pickupable spraybottle_2) (pickupable mug_3) (isreceptacleobject mug_3) (cleanable mug_3) (heatable mug_3) (coolable mug_3) (pickupable tissuebox_4) (pickupable newspaper_5) (pickupable soapbar_6) (cleanable soapbar_6) (pickupable saltshaker_7) (pickupable pan_8) (isreceptacleobject pan_8) (cleanable pan_8) (coolable pan_8) (receptacleatlocation sidetable_1 location1) (receptacleatlocation armchair_2 location7) (receptacleatlocation stoveburner_3 location3) (receptacleatlocation garbagecan_4 location8) (receptacleatlocation cabinet_5 location7) (receptacleatlocation coffeemachine_6 location3) (receptacleatlocation cart_7 location3) (receptacleatlocation sofa_8 location4) (receptacleatlocation microwave_9 location1) (receptacleatlocation fridge_10 location2) (inreceptacle winebottle_1 fridge_10) (inreceptacle spraybottle_2 cart_7) (inreceptacle mug_3 cabinet_5) (inreceptacle tissuebox_4 garbagecan_4) (inreceptacle newspaper_5 garbagecan_4) (inreceptacle soapbar_6 cart_7) (inreceptacle saltshaker_7 cabinet_5) (inreceptacle pan_8 cabinet_5) (objectatlocation winebottle_1 location2) (objectatlocation spraybottle_2 location3) (objectatlocation mug_3 location7) (objectatlocation tissuebox_4 location8) (objectatlocation newspaper_5 location8) (objectatlocation soapbar_6 location3) (objectatlocation saltshaker_7 location7) (objectatlocation pan_8 location7) (atlocation agent1 location6) (= (total-cost) 0))
 (:goal (and (exists (?r_0 - receptacle)
 (exists (?o_0 - obj)
 (and (inreceptacle ?o_0 ?r_0) (objecttype_0 ?o_0 tissueboxtype) (receptacletype_0 ?r_0 sidetabletype))))))
 (:constraints (sometime (atlocation agent1 location8)) (sometime-before (atlocation agent1 location8) (or (checked location5) (atlocation agent1 location4))))
 (:metric minimize (total-cost))
)

; plan
1. (gotolocation agent1 location6 location4)
   deleted: (atlocation agent1 location6)
   added: (atlocation agent1 location4)
   goals met: 0 of 1
2. (gotolocation agent1 location4 location8)
   deleted: (atlocation agent1 location4)
   added: (atlocation agent1 location8)
   goals met: 0 of 1
3. (pickupobject agent1 location8 tissuebox_4 garbagecan_4)
   deleted: (inreceptacle tissuebox_4 garbagecan_4) (objectatlocation tissuebox_4 location8)
   added: (holds agent1 tissuebox_4) (holdsany agent1)
   goals met: 0 of 1
4. (gotolocation agent1 location8 location1)
   deleted: (atlocation agent1 location8)
   added: (atlocation agent1 location1)
   goals met: 0 of 1
5. (putobject agent1 location1 tissuebox_4 sidetable_1 tissueboxtype sidetabletype)
   deleted: (holds agent1 tissuebox_4) (holdsany agent1)
   added: (inreceptacle tissuebox_4 sidetable_1) (objectatlocation tissuebox_4 location1)
   goals met: 1 of 1
